Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: First create a new project using:
ja_jp: 最初に、以下を使用して新しいプロジェクトを作成します。

source: First declare your service as follows:
ja_jp: まず、次のように自分のサービスを宣言します。

source: First let's define a few `QuarkusTestProfile` implementations like so:
ja_jp: まず、次のようないくつかの `QuarkusTestProfile` 実装を定義しましょう。

source: First line of the request
ja_jp: リクエストの最初の行

source: First make sure that xref:vertx-reference.adoc#native-transport[native transport support] is enabled.
ja_jp: まず、xref:vertx-reference.adoc#native-transport[native transport support] が有効になっていることを確認します。

source: First of all, Wiremock needs to be added as a test dependency. For a Maven project that would happen like so:
ja_jp: まず第一に、Wiremockをテスト依存関係として追加する必要があります。Mavenプロジェクトの場合は以下のようになります。

source: First of all, make sure to have an App Engine environment initialized for your Google Cloud project, if not, initialize one via `gcloud app create --project=[YOUR_PROJECT_ID]`.
ja_jp: `gcloud app create --project=[YOUR_PROJECT_ID]` まず最初に、Google Cloud プロジェクト用に App Engine 環境が初期化されていることを確認します。

source: First of all, most of the methods of a Panache entity must be invoked within the scope of a reactive `Mutiny.Session`. In some cases, the session is opened automatically on demand. For example, if a Panache entity method is invoked in a Jakarta REST resource method in an application that includes the `quarkus-rest` extension. For other cases, there are both a declarative and a programmatic way to ensure the session is opened. You can annotate a CDI business method that returns `Uni` with the `@WithSession` annotation. The method will be intercepted and the returned `Uni` will be triggered within a scope of a reactive session. Alternatively, you can use the `Panache.withSession()` method to achieve the same effect.
ja_jp: まず、Panache エンティティーのメソッドのほとんどは、リアクティブ `Mutiny.Session` のスコープ内で呼び出す必要があります。 場合によっては、セッションは要求に応じて自動的に開かれます。 たとえば、 `quarkus-rest` エクステンションを含むアプリケーションの Jakarta REST リソースメソッドで Panache エンティティーメソッドが呼び出される場合です。 その他の場合、セッションが開かれていることを確認するための宣言的な方法とプログラム的な方法があります。 `Uni` を返す CDI ビジネスメソッドに `@WithSession` アノテーションを付けることができます。 メソッドはインターセプトされ、返された `Uni` はリアクティブセッションのスコープ内でトリガーされます。 または、 `Panache.withSession()` メソッドを使用して同じ効果を得ることもできます。

source: First of all, most of the methods of a Panache entity must be invoked within the scope of a reactive `Mutiny.Session`. In some cases, the session is opened automatically on demand. For example, if a Panache entity method is invoked in a Jakarta REST resource method in an application that includes the `quarkus-rest` extension. For other cases, there are both a declarative and a programmatic way to ensure the session is opened. You can annotate a CDI business method that returns `Uni` with the `@WithSession` annotation. The method will be intercepted and the returned `Uni` will be triggered within a scope of a reactive session. If you have multiple persistence units, you can specify which one to use by providing the persistence unit name as the annotation value: `@WithSession("my-persistence-unit")`. If not specified, the default persistence unit is used. Alternatively, you can use the `Panache.withSession()` method to achieve the same effect.
ja_jp: まず、Panache エンティティーのほとんどのメソッドは、リアクティブな `Mutiny.Session` のスコープ内で呼び出される必要があります。場合によっては、セッションはオンデマンドで自動的に開かれます。たとえば、`quarkus-rest` エクステンションを含むアプリケーションの Jakarta REST リソースメソッドで Panache エンティティーメソッドが呼び出される場合です。その他のケースでは、セッションが開かれていることを保証するための宣言的な方法とプログラム的な方法の両方があります。`Uni` を返す CDI ビジネスメソッドに `@WithSession` アノテーションを付けることができます。メソッドはインターセプトされ、返された `Uni` はリアクティブセッションのスコープ内でトリガーされます。複数の永続化ユニットを使用している場合は、アノテーション値として永続化ユニット名 `@WithSession("my-persistence-unit")` を指定することで、どのユニットを使用するかを指定できます。指定しない場合、デフォルトの永続化ユニットが使用されます。あるいは、`Panache.withSession()` メソッドを使用して同じ効果を得ることもできます。

source: First of all, no managed `Engine` instance is available out of the box. You'll need to configure a new instance via `Engine.builder()`.
ja_jp: まず第一に、マネージド `Engine` インスタンスはそのままでは利用できません。 `Engine.builder()` を使って新しいインスタンスを設定する必要があります。

source: First prepare `application.properties`. You can start with a completely empty `application.properties` as `Dev Services for Keycloak` will register `quarkus.oidc.auth-server-url` pointing to the running test container as well as `quarkus.oidc.client-id=quarkus-app` and `quarkus.oidc.credentials.secret=secret`.
ja_jp: 最初に、 `application.properties` を準備します。完全に空の `application.properties` から始めることができます。これは、 `Dev Services for Keycloak` が実行中のテストコンテナーをポイントする `quarkus.oidc.auth-server-url` ならびに `quarkus.oidc.client-id=quarkus-app` および `quarkus.oidc.credentials.secret=secret` を登録するためです。

source: First start the application:
ja_jp: 最初にアプリケーションを起動します。

source: First step is to find the username and password for the admin, so that ACI can authenticate into ACR and pull the Docker image:
ja_jp: 最初のステップは、ACIがACRに認証してDockerイメージをプルできるように、管理者のユーザー名とパスワードを見つけることです。

source: First things first, bootstraping a Quarkus extension is easy: in one command, you can get it scaffolded and get started on the actual implementation. But that's not the subject of this post!
ja_jp: まず最初に、Quarkusエクステンションのブートストラップは簡単です。1つのコマンドで、雛形ができ、実際の実装に取り掛かることができます。しかし、それはこの記事の主題ではありません!

source: First things first, we will need to start with some basic concepts.
ja_jp: まず最初に、いくつかの基本的な概念から始めましょう。

source: First things first: if you are using Assertj in your project, we moved it out of our BOM as binary compatibility was broken quite often and it made things hard for some projects.
ja_jp: 大事なことをまず最初に: プロジェクトでAssertjを使用している場合、私たちはBOMからこれを移動させました。バイナリの互換性がしばしば壊れ、一部のプロジェクトにとって困難な状況になるためです。

source: First we need to enable Vault's `rabbitmq` secret engine, configure it with RabbitMQ's connection and authentication information, and create a Vault role `my-role` (replace `10.0.0.3` by the actual host that is running the RabbitMQ container):
ja_jp: まず、Vault の `rabbitmq` シークレットエンジンを有効にし、RabbitMQ の接続と認証情報を使用して設定し、Vault ロール `my-role` を作成する必要があります ( `10.0.0.3` を RabbitMQ コンテナーを実行している実際のホストに置き換えます)。

source: First we need to start a system to visualise the OpenTelemetry data.
ja_jp: まず、OpenTelemetry データを視覚化するシステムを起動する必要があります。

source: First we need to start a system to visualise the OpenTelemetry data. We have 2 options:
ja_jp: まず、OpenTelemetry データを視覚化するシステムを起動する必要があります。 2 つの選択肢があります。

source: First we tell Quarkus to request dynamic credentials using a credentials-provider named `rabbitmq`.
ja_jp: まず、Quarkus に、 `rabbitmq` という名前のクレデンシャルプロバイダーを使用して動的クレデンシャルを要求するように指示します。

source: First we will create a `StringFunction` interface that some of our beans will implement and which will be injected into another bean later on. Create a `src/main/java/org/acme/spring/di/StringFunction.java` file and set the following content:
ja_jp: まず、 `StringFunction` インターフェースを作成します。これは、いくつかのBeanがこれから実装し、後に別のBeanに注入されます。 `src/main/java/org/acme/spring/di/StringFunction.java` ファイルを作成し、以下の内容を設定します:

source: First you must add the following dependency:
ja_jp: まず、次の依存関係を追加する必要があります。

source: First you need to add the following dependencies:
ja_jp: まず、以下の依存関係を追加する必要があります:

source: First you need to add the following dependency:
ja_jp: まず、次の依存関係を追加する必要があります。

source: First you need to create a Bson `Codec` that will tell Bson how to transform your entity to/from a MongoDB `Document`. Here we use a `CollectibleCodec` as our object is retrievable from the database (it has a MongoDB identifier), if not we would have used a `Codec` instead. More information in the codec documentation: https://mongodb.github.io/mongo-java-driver/3.10/bson/codecs.
ja_jp: まず、Bson `Codec` を作成する必要があります。これは、エンティティーを MongoDB `Document` に変換する方法を Bson に伝えます。ここでは `CollectibleCodec` を使用しています。私たちのオブジェクトはデータベースから取得可能なので (MongoDB の識別子を持っています)、そうでなければ `Codec` を使用しています。詳細はコーデックのドキュメントを参照ください: https://mongodb.github.io/mongo-java-driver/3.10/bson/codecs 。

source: First you need to create a Bson `Codec` that will tell Bson how to transform your entity to/from a MongoDB `Document`. Here we use a `CollectibleCodec` as our object is retrievable from the database (it has a MongoDB identifier), if not we would have used a `Codec` instead. More information in the codec documentation: https://www.mongodb.com/docs/drivers/java/sync/current/fundamentals/data-formats/codecs/.
ja_jp: まず、Bson `Codec` を作成する必要があります。これは、エンティティーを MongoDB `Document` に変換する方法を Bson に伝えます。ここでは `CollectibleCodec` を使用しています。私たちのオブジェクトはデータベースから取得可能なので (MongoDB の識別子を持っています)、そうでなければ `Codec` を使用します。詳細はcodecのドキュメントを参照ください: https://mongodb.github.io/mongo-java-driver/3.10/bson/codecs 。

source: First you will see an option to `Log into Single Page Application`:
ja_jp: まず、 `Log into Single Page Application` オプションが表示されます。

source: First, I would like to thank the author of the original article, SpaceFox, for writing it and for providing such a useful generator.
ja_jp: まず、元の記事の著者であるSpaceFox氏に、執筆とこのような有用なジェネレーターを提供していただいたことに対し、感謝いたします。

source: First, Wiremock needs to be added as a test dependency. For a Maven project that would happen like so:
ja_jp: まず、Wiremockをテストの依存関係として追加する必要があります。Mavenプロジェクトの場合は以下のようになります:

source: First, `libsunec.so`, the C library used for the SSL implementation:
ja_jp: まず、SSLの実装に使用するC言語のライブラリである `libsunec.so` です。

source: First, a JAX-RS resource serving a hello endpoint:
ja_jp: 最初に、helloエンドポイントを提供するアプリケーション:

source: First, a Jakarta REST resource serving a hello endpoint:
ja_jp: まず、helloエンドポイントを提供するJakarta RESTリソース:

source: First, a bean with name `foo` is found and then used as the base object.
ja_jp: まず、 `foo` という名前のBeanを見つけ、それをベースオブジェクトとして使用します。

source: First, a bean with name `personService` is found and then used as the base object.
ja_jp: まず、`personService` という名前の Bean が見つかり、それをベースオブジェクトとして使用します。

source: First, add an *optional* dependency to `quarkus-jackson` on your extension's runtime module.
ja_jp: まず、エクステンションのランタイムモジュールに `quarkus-jackson` への *オプションの* 依存関係を追加します。

source: First, add an *optional* dependency to `quarkus-jsonb` on your extension's runtime module.
ja_jp: まず、エクステンションのランタイムモジュールに `quarkus-jsonb` への *オプションの* 依存関係を追加します。

source: First, add the `quarkus-assistant-deployment-spi` to the *deployment* module of your extension:
ja_jp: まず、エクステンションの *デプロイメント* モジュールに `quarkus-assistant-deployment-spi` を追加します。

source: First, add the `quarkus-infinispan-cache` extension to your project:
ja_jp: まず、プロジェクトに `quarkus-infinispan-cache` エクステンションを追加します。

source: First, add the following dependencies:
ja_jp: まず、次の依存関係を追加します。

source: First, add the following dependency to your application:
ja_jp: まず、以下の依存関係をアプリケーションに追加します。

source: First, add the following dependency, which provides a utility class `io.quarkus.test.keycloak.client.KeycloakTestClient` that you can use in tests for acquiring the access tokens:
ja_jp: まず、次の依存関係を追加します。この依存関係は、アクセストークンを取得するテストで使用できるユーティリティークラス `io.quarkus.test.keycloak.client.KeycloakTestClient` を提供します。

source: First, add the following dependency:
ja_jp: まず、以下の依存関係を追加します。

source: First, add the following test dependency to your application:
ja_jp: まず、以下のテスト依存関係をアプリケーションに追加します。

source: First, add the plugin to your `pom.xml`:
ja_jp: まず、プラグインを `pom.xml` に追加します。

source: First, as usual, create a new realm or import the existing realm to `Keycloak`. In this case, the realm name has to be `quarkus`.
ja_jp: まず、通常どおりに、新しいレルムを作成するか、既存のレルムを `Keycloak` にインポートします。 この場合、レルム名は `quarkus` にする必要があります。

source: First, be aware that referencing beans in configuration properties is optional and, in fact, discouraged: you can achieve the same results by annotating your beans with `@SearchExtension`. See <<plugging-in-custom-components,this section>> for more information.
ja_jp: まず、設定プロパティーで Bean を参照することはオプションであり、実際には推奨されていないことに注意してください。 Bean に `@SearchExtension` アノテーションを付けることによって、同じ結果を得ることができます。 詳細は <<plugging-in-custom-components,this section>> を参照してください。

source: First, because the collection integrated, we can check the status of the service on one of the targets:
ja_jp: まず、コレクションが統合されたので、ターゲットの1つでサービスのステータスをチェックできます：

source: First, change your Quarkus application type from `web-app` to `hybrid`, as follows:
ja_jp: まず、次のように Quarkus アプリケーションタイプを `web-app` から `hybrid` に変更します。

source: First, compile it:
ja_jp: まず、コンパイルします:

source: First, create a `GreetingResource` JAX-RS resource in the `src/main/java/org/acme/spring/boot/properties/GreetingResource.java` file that looks like:
ja_jp: まず、 `src/main/java/org/acme/spring/boot/properties/GreetingResource.java` ファイルに以下のような `GreetingResource` JAX-RSリソースを作成します。

source: First, create a `GreetingResource` Jakarta REST resource in the `src/main/java/org/acme/spring/boot/properties/GreetingResource.java` file that looks like:
ja_jp: まず、 `src/main/java/org/acme/spring/boot/properties/GreetingResource.java` ファイルに以下のような `GreetingResource` Jakarta RESTリソースを作成します。

source: First, create a new Maven project and copy the `pom.xml` file that is present in the `quickstart` directory.
ja_jp: まず、新しいMavenプロジェクトを作成し、 `quickstart` ディレクトリーに存在する `pom.xml` ファイルをコピーします。

source: First, create a new `SAML2` integration in your `Okta` `Dashboard/Applications`:
ja_jp: まず、 `Okta` `Dashboard/Applications` に新しい `SAML2` インテグレーションを作成します：

source: First, create a new entity to represent our `Ally`.
ja_jp: まず、 `Ally` を表すエンティティを新規に作成します。

source: First, create a new project with the following command:
ja_jp: まず、以下のコマンドで新規プロジェクトを作成します:

source: First, create a simple `GreetingResource` JAX-RS resource in the `src/main/java/org/acme/spring/cloud/config/client/GreetingResource.java` file that looks like:
ja_jp: まず、以下のような簡単な `GreetingResource` JAX-RSリソースを `src/main/java/org/acme/spring/cloud/config/client/GreetingResource.java` ファイルに作成します。

source: First, create a simple `GreetingResource` Jakarta REST resource in the `src/main/java/org/acme/spring/cloud/config/client/GreetingResource.java` file that looks like:
ja_jp: まず、 `src/main/java/org/acme/spring/cloud/config/client/GreetingResource.java` ファイルに、以下のようなシンプルな `GreetingResource` Jakarta REST リソースを作成します：

source: First, create a simple entity representing a coffee sample in our store:
ja_jp: まず、お店のコーヒーのサンプルを表すシンプルなエンティティを作成します。 :

source: First, create an Azure Resource Group:
ja_jp: まず、Azure Resource Groupを作成します。

source: First, create an `app.yaml` file at the root of your project with the following content:
ja_jp: まず、プロジェクトのルートに以下の内容の `app.yaml` ファイルを作成します。

source: First, create the `src/main/java/org/acme/MailResource.java` file, with the following content:
ja_jp: まず、以下の内容で `src/main/java/org/acme/MailResource.java` というファイルを作成します。

source: First, create the file `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/WeatherStation.java`, representing a weather station, with the following content:
ja_jp: まず、次の内容でファイル `aggregator/src/main/java/org/acme/kafka/streams/aggregator/model/WeatherStation.java` を作成します。

source: First, create the following entities representing a film from a galaxy far far away:
ja_jp: まず、遠く離れた銀河系の映画を表す次のような実体を作りなさい。

source: First, create the following entities representing a film from a galaxy far, far away:
ja_jp: まず、はるか彼方の銀河系の映画を表す以下のエンティティを作成します:

source: First, create this new abstract type representing the possible return types for a search result.
ja_jp: まず、検索結果の返り値を表す新しい抽象型を作成します。

source: First, define the `Post` and `Put` groups, which are just Java interfaces.
ja_jp: まず、 `Post` と `Put` グループを定義します。これらは単なるJavaインターフェースです。

source: First, download https://www.gutenberg.org/files/2600/2600-0.txt[War and Peace] and store it in `src/main/resources/book.txt`. It's a 3.2 Mb file, which, while not being huge, illustrates the purpose of streams. This time, we will not accumulate the file's content in memory and write it in one batch, but read it chunk by chunk and write these chunks into the HTTP response one by one.
ja_jp: まず、 link:https://www.gutenberg.org/files/2600/2600-0.txt[戦争と平和]をダウンロードして、 `src/main/resources/book.txt` に保存します。これは3.2Mbのファイルで、巨大ではありませんが、ストリームの目的を説明しています。今回は、ファイルの内容をメモリに蓄積して一括して書き込むのではなく、チャンクごとに読み込んで、そのチャンクを1つずつHTTPレスポンスに書き込んでいきます。

source: First, go to https://code.quarkus.io[code.quarkus.io] and select the following extensions:
ja_jp: まず、 link:https://code.quarkus.io[code.quarkus.io]にアクセスし、以下のエクステンションを選択します:

source: First, https://smallrye.io/smallrye-mutiny[Mutiny] is an intuitive, event-driven reactive programming library. With Mutiny, you write event-driven code. Your code is a pipeline receiving events and processing them. Each stage in your pipeline can be seen as a continuation, as Mutiny invokes them when the upstream part of the pipeline emits an event.
ja_jp: まず、 link:https://smallrye.io/smallrye-mutiny[Mutiny]は直感的なイベント駆動型のリアクティブ・プログラミング・ライブラリです。Mutinyでは、イベント駆動型のコードを書きます。あなたのコードは、イベントを受け取り、それを処理するパイプラインです。パイプラインの各ステージは継続と見ることができ、パイプラインの上流部分がイベントを発するとMutinyがそれらを呼び出すからです。

source: First, include a tip just below your `application.properties` extract:
ja_jp: まず、抽出した `application.properties` のすぐ下にチップを入れます。

source: First, include one of the Quarkus REST (formerly RESTEasy Reactive) extensions to enable Jakarta REST endpoints, for example, add the `io.quarkus:quarkus-rest-jackson` dependency for Jakarta REST and JSON support.
ja_jp: まず、Quarkus REST（旧RESTEasy Reactive）エクステンションのいずれかを追加して、Jakarta RESTエンドポイントを有効にします。たとえば、Jakarta RESTとJSONをサポートする `io.quarkus:quarkus-rest-jackson` 。

source: First, include one of the RESTEasy Reactive extensions to enable JAX-RS endpoints, for example, add the `io.quarkus:quarkus-resteasy-reactive-jackson` dependency for JAX-RS and JSON support.
ja_jp: まず、JAX-RSエンドポイントを有効にするために、RESTEasy Reactiveエクステンションの1つを含めます。例えば、JAX-RSとJSONのサポートのために `io.quarkus:quarkus-resteasy-jackson` の依存関係を追加します。

source: First, include one of the RESTEasy Reactive extensions to enable Jakarta REST endpoints, for example, add the `io.quarkus:quarkus-resteasy-reactive-jackson` dependency for Jakarta REST and JSON support.
ja_jp: まず、Jakarta RESTエンドポイントを有効にするために、RESTEasy Reactiveエクステンションのいずれかを組み込みます。例えば、Jakarta RESTとJSONをサポートするために、 `io.quarkus:quarkus-resteasy-reactive-jackson` の依存関係を追加します。

source: First, include one of the RESTEasy extensions to enable JAX-RS endpoints, for example, add the `io.quarkus:quarkus-resteasy-jackson` dependency for JAX-RS and JSON support.
ja_jp: まず、JAX-RSエンドポイントを有効にするためにRESTEasyエクステンションの1つを組み込みます。例えば、JAX-RSとJSONをサポートするために `io.quarkus:quarkus-resteasy-jackson` の依存関係を追加します。

source: First, include one of the RESTEasy extensions to enable JAX-RS endpoints, for example, add the `io.quarkus:quarkus-resteasy-reactive-jackson` dependency for JAX-RS and JSON support.
ja_jp: まず、JAX-RSエンドポイントを有効にするために、RESTEasyのエクステンションの1つを含めます。例えば、JAX-RSとJSONのサポートのために、 `io.quarkus:quarkus-resteasy-reactive-jackson` の依存関係を追加します。

source: First, include one of the RESTEasy extensions to enable Jakarta REST endpoints, for example, add the `io.quarkus:quarkus-rest-jackson` dependency for Jakarta REST and JSON support.
ja_jp: まず、RESTEasy エクステンションの 1 つを組み込み、Jakarta REST エンドポイントを有効にします。たとえば、Jakarta REST および JSON サポートの場合は `io.quarkus:quarkus-rest-jackson` 依存関係を追加します。

source: First, let us create the `Fruit` bean as follows:
ja_jp: まず、次のように `Fruit` Bean を作成してみましょう。

source: First, let's add test dependencies on REST Client and Awaitility to the build file:
ja_jp: まず、REST クライアントと Awaitility のテスト依存関係をビルドファイルに追加します。

source: First, let's add the Nisse Maven plugin to the `pom.xml`. This plugin must be added to the `<build>` section of the file:
ja_jp: まず、Nisse Maven プラグインを `pom.xml` に追加しましょう。 このプラグインは、ファイルの `<build>` セクションに追加する必要があります：

source: First, let's add the os-maven-plugin to the `pom.xml`. This plugin works as a Maven extension and as such must be added to the `<build>` section of the file:
ja_jp: まず、 `pom.xml` に os-maven-plugin を追加しましょう。このプラグインは、Maven のエクステンションとして動作するため、ファイルの `<build>` セクションに追加する必要があります。

source: First, let's create a `K8sCel` Java class where to place our annotation:
ja_jp: まず、アノテーションを配置する `K8sCel` Java クラスを作成しましょう。

source: First, let's create our Hibernate ORM entities `Book` and `Author` in the `model` subpackage.
ja_jp: まず、 `model` サブパッケージに Hibernate ORM エンティティ `Book` と `Author` を作成しましょう。

source: First, let's create our `Book` and `Author` classes in the `model` subpackage.
ja_jp: まず、 `model` サブパッケージに `Book` クラスと `Author` クラスを作成します。

source: First, let's create our data model – represented by the `Fruit` class – as follows:
ja_jp: まず、以下のように `Fruit` クラスであらわされるデータモデルを作成してみましょう。

source: First, let's create the `Fruit` bean as follows:
ja_jp: まず、以下のように `Fruit` Bean を作成してみましょう。

source: First, let's declare another DAO interface that works in a reactive way:
ja_jp: まず、リアクティブな方法で機能する別の DAO インターフェイスを宣言しましょう:

source: First, let's disable it without changing the REST service URL and see how it goes.
ja_jp: まずは、RESTサービスのURLを変えずに無効化して様子を見てみましょう。

source: First, let's look at the why. Events are everywhere. Many modern systems are using events one way or another. Events can be used to implement event sourcing, communicate facts, trigger out-of-band processing, or send notifications. Events become an essential piece of any system.
ja_jp: まずは「なぜ」を見てみましょう。イベントはどこにでもあります。最近のシステムの多くは、何らかの方法でイベントを使用しています。イベントは、イベントソーシングの実装、事実の伝達、帯域外処理のトリガー、通知の送信などに使用できます。イベントはどんなシステムにも欠かせないものとなっています。

source: First, let's mark the `Author` type as an link:{hibernate-search-docs-url}#concepts-entity[entity type]. In short, this implies the `Author` type it has its own, distinct lifecycle (not tied to another type), and that every `BookAuthor instance carries an immutable, unique identifier.
ja_jp: まず、 `Author` タイプを link:{hibernate-search-docs-url}#concepts-entity[エンティティータイプ] とマークします。 つまり、これは `Author` タイプが独自のライフサイクル (他のタイプに結びついていない) を持ち、 すべての `BookAuthor インスタンスはイミュータブルな一意の識別子を持つことを意味します。

source: First, let's start the GraalVM container, noting the container id output.
ja_jp: まず、GraalVMコンテナーを起動して、コンテナーIDの出力に注目してみましょう。

source: First, let's to declare another DAO interface that works in a reactive way:
ja_jp: まず、リアクティブな方法で機能する別の DAO インターフェイスを宣言しましょう。

source: First, let's use the `@Indexed` annotation to register our `Book` entity as part of the full text index.
ja_jp: まず、 `@Indexed` アノテーションを使って、 `Book` エンティティを全文検索インデックスの一部として登録してみましょう。

source: First, libsunec.so, the C library used for the SSL implementation:
ja_jp: まず、SSLの実装に使用するC言語のライブラリである libsunec.so です。

source: First, login to Heroku's container registry:
ja_jp: まず、Heroku のコンテナーレジストリーにログインします。

source: First, make sure to have an App Engine environment initialized for your Google Cloud project, if not, initialize one via `gcloud app create --project=[YOUR_PROJECT_ID]`.
ja_jp: まずはじめに、Google Cloud プロジェクト用に App Engine 環境が初期化されていることを確認してください。もしまだであれば、 `gcloud app create --project=[YOUR_PROJECT_ID]` で初期化してください。

source: First, make sure you stopped the applications, and build both applications in JVM mode with:
ja_jp: まず、アプリケーションを停止したことを確認し、次のコマンドを使用して両方のアプリケーションを JVM モードでビルドします。

source: First, make sure your project has the `quarkus-reactive-pg-client` extension enabled. If you are creating a new project, use the following command:
ja_jp: まず、プロジェクトで `quarkus-reactive-pg-client` のエクステンションが有効になっていることを確認します。新しいプロジェクトを作成する場合は、次のコマンドを使用します。

source: First, no managed `Engine` instance is available out of the box. You'll need to configure a new instance via `Engine.builder()`.
ja_jp: まず第一に、すぐに使用できるマネージド `Engine` インスタンスはありません。新しいインスタンスを `Engine.builder()` で設定する必要があります。

source: First, prepare `application.properties`. You can start with a completely empty `application.properties` file as `Dev Services for Keycloak` will register `quarkus.oidc.auth-server-url` pointing to the running test container as well as `quarkus.oidc.client-id=quarkus-app` and `quarkus.oidc.credentials.secret=secret`.
ja_jp: まず、 `application.properties` を準備します。 `Dev Services for Keycloak` は、実行中のテストコンテナーを指す `quarkus.oidc.auth-server-url` のほか、 `quarkus.oidc.client-id=quarkus-app` および `quarkus.oidc.credentials.secret=secret` を登録するため、完全に空の `application.properties` ファイルから開始できます。
